In [112]:
import pandas as pd
import numpy as np

# Exercise 1

In [123]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep='\t')

In [124]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [125]:
print('Rows: ',chipo.shape[0])

Rows:  4622

In [126]:
print('Columns: ',chipo.shape[1])

Columns:  5

In [127]:
print('Index type:', chipo.index)

Index type: RangeIndex(start=0, stop=4622, step=1)

In [128]:
print('Most ordered item:', chipo['item_name'].value_counts().idxmax())

Most ordered item: Chicken Bowl

In [129]:
print('Total items ordered:', chipo['quantity'].sum())

Total items ordered: 4972

In [130]:
print('Most ordered item:', chipo['choice_description'].value_counts().idxmax())

Most ordered item: [Diet Coke]

In [131]:
chipo['item_price'] = chipo['item_price'].apply(lambda x: float(x[1:]))

In [132]:
chipo['item_price'][0].dtype

dtype('float64')

In [135]:
print('Total revenue:', chipo['item_price'].sum(),'dollars')

Total revenue: 34500.16 dollars

In [136]:
print('Total number of orders:', chipo['order_id'].nunique())

Total number of orders: 1834

In [142]:
total_revenue = chipo['item_price'].sum()
total_orders = chipo['order_id'].nunique()
print('Average order value:', np.round(total_revenue / total_orders, 2))

Average order value: 18.81

In [143]:
print('Total unique items sold:', chipo['item_name'].nunique())

Total unique items sold: 50

# Exercise 2

In [151]:
print('Count of products that cost more than $10:', chipo[chipo['item_price'] > 10].shape[0])

Count of products that cost more than $10: 1130

# Exercise 3

In [161]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')

In [162]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [163]:
print(users.groupby('occupation')['age'].mean())

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [164]:
# Exercise 4

In [199]:
data1 = {
    'Animal': ['Chimpanze', 'Beaver', 'Grand Beaver'],
    'Age': [23, 4, 15],
    'Random_word': ['Gudwin', 'Arch', 'Bold']
}
data2 = {
    'Animal': ['Собака', 'Кошка', 'Осел'],
    'Age': [1, 22, 1222],
    'Random_word': ['Sorcerer', 'Bow', 'Shwarma']
}

In [200]:
data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)

In [201]:
merged_data_row = pd.concat([data1, data2], ignore_index=True)

In [202]:
merged_data_col = pd.concat([data1, data2], axis=1)

In [204]:
merged_data_row

         Animal   Age Random_word
0     Chimpanze    23      Gudwin
1        Beaver     4        Arch
2  Grand Beaver    15        Bold
3        Собака     1    Sorcerer
4         Кошка    22         Bow
5          Осел  1222     Shwarma

In [205]:
merged_data_col

         Animal  Age Random_word  Animal   Age Random_word
0     Chimpanze   23      Gudwin  Собака     1    Sorcerer
1        Beaver    4        Arch   Кошка    22         Bow
2  Grand Beaver   15        Bold    Осел  1222     Shwarma

In [206]:
# Exercise 5

In [207]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')

In [208]:
iris.head(5)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [209]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [210]:
iris.head(0)

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

In [211]:
print(iris.isnull().sum())

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64